testsrc/main/mondrian/xmla/error/BadMethod.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <Foo>Have a nice day</Foo>
  </Header>
  <Body>
    <FooExecute xmlns="urn:schemas-microsoft-com:xml-analysis">
      <Command>
        <Statement/>
      </Command>
      <Properties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DataSourceInfo>MondrianFoodMart</DataSourceInfo>
        </PropertyList>
      </Properties>
    </FooExecute>
  </Body>
</Envelope>
